# โปรแกรมหลัก

# Module คือ การเรียกใช้ฟังก์ชั่นจากอีกไฟล์หนึ่งเพื่อสะดวกแก่การที่เราไม่ต้องหาฟังก์ชั่นมาเขียนอีกช่วยในเรื่องของการจัดข้อมูลให้มีระเบียบบขึ้น ย่อๆคือ "โปรแกรมย่อย"
	# 1.ให้เขียนคำว่า import ตามด้วย ชื่อไฟล์ที่เราต้องการเรียกใช้
	# 2.ให้เขียน ชื่อไฟล์ที่เราต้องการจะเรียกใช้.ชื่อฟังก์ชั่นที่เราต้องการเรียกใช้
	# 3.สามารถตั้งชื่อเล่นเพื่อง่ายต่อการเรีกใช้ ให้เขียนคำว่า [import ชื่อไฟล์ที่เราต้องการเรียกใช้ as ชื่อเล่นที่เราต้องการ]
	# 4.ถ้าเราต้องการแค่ฟังกชั่นจาก Module แค่ตัวเดียว ให้เขียนคำว่า [from Moduleที่เราต้องการเรียกใช้ import ฟังกชั่นที่เราต้องการเรียกใช้]หลังจากนั้นเราพิมพ์แค่ชื่อฟังก์ชั่นก็สามารถเรียกใช้งานได้
	# 5.ถ้าเราต้องการเรียกใช้ฟังก์ชั่นทั้งหมดจาก Module นั้นๆ ให้เขียนคำว่า [from ชื่อ Module import *] หลังจากนั้นเราจะพิมพ์แค่ชื่อฟังกชั่นไม่จำเป็นต้องตามกด้วย ชื่อ Module.[Anything] อีก
	# 6.ถ้าเราต้องการเรียกใช้ฟังก์ชั่นจาก Module ที่อยู่คนละ Folder ให้เขียนคำว่า [from ชื่อ Folder.ชื่อ Module import]

from Mypackage.CalculateService import *
from Mypackage.Weather import *

print(PI)
print(City)

addition(25,20,40)
power(5,7)