# การสุ่มตัวเลข
# random.random() = ให้สุ่มตัวเลขถ้าไม่ได้เติมค่าอะไรเป็นวงเล็บว่างเปล่าแบบนี้คือ 0.0-1.0
# random.uniform(ตัวเลข1,ตัวเลข2) = เป็นการสุ่มตัวเลขระหว่าง ตัวเลขที่1 ถึง ตัวเลขที่ 2
# random.randrange(start,stop,step) # random.randrange จะระบุค่าสุ่ม "เป็นจำนวนเต็ม"
# ถ้าเขียนว่า randomrandrange(1,10,2) หมายถึงให้ทำการสุ่มตัวเลขเพิ่มขึ้นทีละ 2 ดังนี้จะเหลือแค่ตัวเลขที่จะแสดงผลออกมา คือ 1,3,5,7,9
# ถ้าเขียนว่า randomrandrange(0,10,2) หมายถึงให้ทำการสุ่มตัวเลขเพิ่มขึ้นทีละ 2 ดังนี้จะเหลือแค่ตัวเลขที่จะแสดงผลออกมา คือ 2,4,6,8,10
# random.tandint(ตัวเลข1,ตัวเลข2) = เป็นการสุ่มตัวเลข "จำนวนเต็ม" ขึ้นมา
# random.choice(xxxx) = เป็นการสุ่มการแสดงผลตามสมาชิกที่ระบุไว้ใน พารามิเตอร์
# random.shuffle(xxxx) = ให้ทำการสลับสมาชิกในพารามิเตอร์นั้นๆ


import random

items=[1,2,3,4,5,"A","B","C"]
random.shuffle(items)
print(items)

for i in range(15): # ตัวอย่างที่ Kongruksiam นำเสนอบอกว่าสามารถ"ลดรูป" ได้?
    x=random.choice("0123456789")
    print(x)