# Math ต้องมีการ import math ก่อน
# min() = เป็นการถามว่าจำนวนไหนมีค่าต่ำสุด
# max() = เป็นการถามว่าจำนวนไหนมีค่าสูงสุด
# abs() = absolute => ค่าสัมบูรณ์
# pow() = เป็นการถามค่าเลขยกกำลัง(ต้องใส่พารามิเตอร์ 2 พารามิเตอร์ในการหาค่านี้)
# sqrt() = หาค่า "สแควร์รูท"
# math.floor = เป็นการปัดเลขทศนิยม "ลง" # ถ้าเป็นการระบุว่าถ้าค่าทศนิยมต่ำกว่า 0.5 ปัดเศษลง และค่าทศนิยมมากกว่า 0.4 ปัดเศษขึ้น ทำยังไง?
# math.ceil = เป็นกรปัดเลขทศนิยม "ขึ้น"
# ค่า Defaut ของตรีโกณมิติ มีหน่วยเป็น Degree ถ้าอยากได้ค่าเป็น radians ต้องมีการระบุ "math.radians()"
# math.dist = เป็นการหาค่าระยะทาง 2 ค่า

import math

# # ค่าตรีโกณมิติ
# convert=math.radians(30)

point1=[5,4]
point2=[5,13]

d=math.dist(point1,point2)
print(d)

# ลอการิทึม # ทำความเข้าใจเกี่ยวกับลอการิทึม
l1=math.log2(32)
print(l1)