# Dictionary มีความสามารถในการออกแบบ index ได้
# list , tuple
lis=["สีแดง","สีเหลือง","สีเขียว"]
tup=("สีแดง","สีเหลือง","สีเขียว")

# if "สีเขียว" in lis :
# line 6 เปลี่ยนเป็นคอมเมนต์เพราะไม่สามารถแก้ไขได้ อยากเรียนรู้แล้วเข้าใจ
# # ในคลิปพิมพ์แค่นี้ไม่ขึ้น error ทำไมของเราขึ้น ? # ได้คำตอบแล้วคือเราไม่ได้เติมเครื่องหมาย ":" ( - -')

# Dictionary => key (การเข้าถึงข้อมูล) , value (ค่าของข้อมูล)
# list, tuple=. index , value
# การสร้าง dict
# ชื่อตัวแปร = {key:value,key:value,key:value}
city={"bangkok":"กรุงเทพ"}
animal={"ไก่":"chicken","แมว":"cat","dog":"น้องหมา"}
student={"ก้อง":40,"โจ้":50,"โค้ช":100}
room={300:"นาย A",301:"นาย B",302:"นาย C"}
print(room[300])

pets=dict(cat="แมว",dog="น้องหมา",duck="น้องเป็ด") # ระหว่างมี dict กับไม่มี ต่างกันอย่างไรต้องไปหาคำตอบมาควรเปิดฟังที่ร้านด้วย
												# ดูเหมือนไม่แตกต่างกัน
print(pets["cat"])

colors=dict({"red":"สีแดง","yellow":"สีเหลือง","green":"สีเขียว",98:"บ้านแสนสุช",100:"บ้านป่า",True:"โสด",False:"แต่งงานแล้ว"})
print(colors[100])
print(colors.get("red")) # เขียนได้ทั้ง 2 แบบ
print(colors[False]) # เป็น boolean ได้

colors[100]="บ้านสวน" # เป็นการบอกว่าให้ "บ้านสวน" แทนที่ค่า "บ้านป่า"
print(colors)
colors.update({"blue":"สีน้ำเงิน","orange":"สีส้ม","red":"สีชมพู"}) # เพิ่มสมาชิกลงไปใน dict ด้วยฟังก์ชั่น update
															  # มีการแก้ไขข้อมูลสมาชิก red ที่มีอยู่แล้วทำให้ สีแดงที่เป็น value ของ red ต้องเปลี่ยน value เป็นสีชมพู  
print(colors)

for item in colors: # ถ้าพิมพ์แค่นี้สิ่งที่เราได้จะเป็น key
    print(item)
    
for item in colors.values(): # ถ้าพิมพ์แบบนี้สิ่งที่ได้จะเป็น value
    print(item)
    
for k,v in colors.items(): # k , v เป็นตัวแปรที่ย่อเป็น key , value
	print("key = ",k ," value = ",v)

print(colors)
colors.pop("red") # คำสั่งลบสมาชิก
colors.popitem() # เอาสมาชิกตัวนอกสุดออกไป
colors.popitem()
print(colors)
# colors.clear() # เคลียร์ข้อมูลทั้งหมดออกไปเหลือแต่ colors ที่เป็นค่าว่าง
			   # del คือการลบออกไปทั้งหมดรวมถึง colors ด้วย
print(colors)

x=colors.copy()
print(x)

# dictionary => key (การเข้าถึงข้อมูล) , value (ค่าของข้อมูล)

# market={
#      "ร้านป้าพร":"ขายอาหารตามสั่ง",
# 	 "ร้านลุงป้อม":"ขายผลไม้",
# 	 "ร้านน้าใจ":"ขายเครื่องดื่ม"
# }
market={
     "ร้านป้าพร":{
          "name":"ป้าพร",
		  "menu":["กะเพราไก่","ก๋วยเตี๋ยว"],
		  "zone":'ตะวันออก'
	 },
	 "ร้านลุงป้อม":{
           "name":"น้าจ๊อบ",
		   "menu":["มะม่วง","ทึเรียน"],
		   "zone":'ทางเข้าตลาด'
	 },
      "ร้านน้าใจ":{
           "name":"น้าใจ",
           "menu":["นมปั่น","ชาเย็น"],
		   "zone":'ข้าง 7-11'
	  }
}


print(market["ร้านป้าพร"]["menu"])

print("ก๋วยเตี๋ยว" in market["ร้านป้าพร"]["menu"]) # เป็นการถามว่า ก๋วยเตี๋ยวอยู่่ในร้างป้าพรหรือไม่

if "ทุเรียน" in market ["ร้านป้าพร"]["menu"]:
	print("เป็น")
else :
	print("ไม่เป็น")