# function return ค่า

"""
1.ไม่มีการรับค่าและส่งค่า
def name():

2.มีการรับค่าเข้าไปทำงาน
def name(a,b):

3.รับค่าเข้าไปทำงาน และส่งออกมา
def name(a,b):
	return a+b

4.ไม่มีการรับค่าเข้ามา แต่ส่งค่าออกไป
"""

def add (a,b):
    # print(a+b) ตัวนี้แบบธรรมดาซึ่งผลลัพธ์จะทำงานแค่ในฟังก์ชั่นเท่านั้น แต่ถ้าเราอยากให้นำผลลัพธ์ออกมาจากข้างนอกฟังก์ชั่นต้องมีการตั้งค่า return ดูจากการเขียนด้านล่าง
	return(a+b)

def showNumber(): # เป็นการเขียนฟังก์ชั่นกรณีแบบที่ 4 คือ ไม่มีการรับค่าเข้ามา แต่ส่งค่าออกไป
	return 500

x=add(10,20) # มีการระบุให้ฟังก์ชั่น add ส่งค่าคืนออกมาแล้วและตอนนี้ให้นำผลลัพธ์ที่ได้มาเก็บในค่า x
print(x)

z=showNumber()
print("ตัวเลข = ",z)

# ฟังก์ชั่นในการตรวจเลขหวย
def randomNumber(x): # มีการให้นำค่า argument เก็บลงไปในค่า Parameter x แล้วนำค่า x ไปตั้งค่า if and else อีกที
	if x =='100':
		print("ถูกหวย")
		return 1000
	else :
		print("ไม่ถูกหวย")
		return 0

randomNumber("100") # ถ้าไม่มีการตั้งค่าตัวแปรเพิ่มจะไม่สามารถนำข้อมูลตัวเลขที่เราต้องการ return เอากลับมาแสดงผลได้
money=randomNumber("100") # มีการตั้งค่าตัวแปรแล้วเพื่อต้องการนำค่า return จากฟังก์ชั่น randomNumber
money=randomNumber("100") # มีการตั้งค่าตัวแปรแล้วเพื่อต้องการนำค่า return จากฟังก์ชั่น randomNumber
x=300
result=money-x
print("เงินรางวัล = ",money) # ข้อมูลที่จะแสดงออกมาแค่ค่าที่มีการตั้งค่า return ส่วนค่าที่เราส่งเข้าไปจะไม่ออกมาแสดงผลด้วย
print("เงินคงเหลือ = ", result)

def randomNumberx(x):
	if len(x)<3 : # เป็นการบอกว่าถ้าค่าที่รับเข้ามาใน Parameter x มีค่าน้อยกว่าเลขสามหลัก (len) มีลักษณะการนับเป็นตัวอักษรคล้าย (String) จะส่งค่าว่างเปล่ากลับออกมา
		return # คำสั่งสมบูรณ์แล้วแม้จะไม่ได้ป้อนค่าใดก็ตาม

	if x == "100":
		print("ถูกหวย")
		return 1000
	else :
		print("ไม่ถูกหวย")
		return 0

moneyx=randomNumberx("50")
print("เงินรางวัล = ",moneyx)