# Fibonacci number คือ การนำตัวเลขหน้าสองตัวมาบวกกันแล้วได้ผลลัพธ์ถ้าต้องการทำซ้ำทับกันไปเรื่อยๆ

# 0, 1, 1, 2, 3, 5, 8,......

# f0 = ? , f1 = ?

def fibonacci(number):
    if number<=1:
        return number
        # 2 ลำดับแรก
    else :
        # เลขลำดับถัดไป
        return fibonacci(number-1) + fibonacci(number-2) # ในวงเล็บเป็นการหาค่าตำแหน่งที่เราต้องการบวกกันไม่ใช่ผลลัพธ์แต่แรกที่เราต้องการที่เราต้องการคือการระบุตำแหน่งที่เราต้องการบวกัน

for i in range(10):
    print(fibonacci(i))


    """
    i = 0
    i = 1
    i = 2
    i = 3
    i = 4
    0 , 1 , 9 , 9 , 9
    """

    """
    หลังจากเพิ่มค่า else เป็น return fibonacci(number-1) + fibonacci(-2)
    i = 0
    i = 1
    i = 2


    o , 1 , สมาการที่เกิดขึ้นในลำดับที่สาม fibonaccinumber(ชื่อฟังก์ชั่น) (2-1) + fibonaccinumber(2-2)
    """

    """
    o , 1 , 2 , 3 , 4 , 5
    2 = 2 - 1 = 1 , 2 - 2 = 0
    2 = 1 + 0 = 1 เลขหลักตัวที่ 3 = 1
    3 = 3 - 1 = 2 , 3 - 2 = 1
    3 = 2 + 1 = 3
    
    """